# FabricSheetDefaultMajorLapspliceLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricSheetDefaultMajorLapspliceLength Property
ParameterTypeId Class See Also
---
"Default Major Lap Splice Length": Default Major Lap Splice Length
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricSheetDefaultMajorLapspliceLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricSheetDefaultMajorLapspliceLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricSheetDefaultMajorLapspliceLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace